"""
Вам дано целое число n. Проверьте, есть ли у n нечетный делитель,
отличный от единицы (существует ли такое число x (x>1), что n делится на x и x нечетно).
Например, если n=6, то существует x=3. Если же n=4, то такого числа не существует.

Входные данные
В первой строке записано одно целое число t (1≤t≤104) — количество наборов входных данных.
Далее следуют t наборов входных данных.
Каждый набор входных данных содержит одно целое число n (2≤n≤1014).
Обратите внимание, что числа в некоторых наборах входных данных не влезают в 32-битный целочисленный тип,
поэтому вы должны использовать как минимум 64-битный целочисленный тип вашего языка программирования.

Выходные данные
Для каждого набора входных данных в отдельной строке выведите:
«YES», если у n есть нечетный делитель отличный от единицы;
«NO» в противном случае.
Вы можете выводить «YES» и «NO» в любом регистре (например, строки yEs, yes,
Yes и YES будут распознаны как положительный ответ).
"""


def find_del(a: int) -> str:
    """return Yes if number have odd divisor else No"""
    while a % 2 == 0:
        a = a // 2
    return 'YES' if a != 1 else 'NO'


t = int(input())  # How much times we will use the function

for i in range(t):
    n = int(input())
    print(find_del(n))
